/***********************************************************/
/*   测试在windows xp（32位）下，大数组的定义和出现的问题  */
/*   创建日期：2011-4-26*/
/*   作者：王帅华*/
/*   版本：1.0.0*/
/**********************************************************/

#include "stdio.h"

int main(void)
{
	unsigned int i = 0;
	unsigned int j = 0;
	int arr[65535][65535] = {0};/*在该系统下给数组分配
								15.9995117224752902984619140625G
								约为16G的内存，肯定会出错*/
	for (i=0; i<65535; i++)
	{
		for (j=0; j<65535; j++)
		{
			printf("array[%d][%d] = %d\n",arr[i][j]);
		}
	}
	return 0;
}

/*
错误显示：
peixun_006.exe 中的 0x102336ae (msvcr80d.dll) 处最可能的异常: 0xC0000005: 写入位置 0x00130000 时发生访问冲突
peixun_006.exe 中的 0x00000000 处最可能的异常: 0xC0000005: 读取位置 0x00000000 时发生访问冲突
*/